server/app/controllers/tasks_controller.rb

  def set_todo
    @todo = Todo.find(params[:todo_id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_todo_task
    @task = @todo.tasks.find_by!(id: params[:id]) if @todo
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."todo_id" = ? AND "tasks"."id" = ? LIMIT ?  [["todo_id", 1], ["id", 1], ["LIMIT", 1]]