server/app/controllers/tasks_controller.rb

  def index
    @task = Task.where(user: current_user, todo: @todo).page params[:page]
---
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."todo_id" = ?  [["user_id", 2], ["todo_id", 2]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."todo_id" = ? LIMIT ? OFFSET ?  [["user_id", 2], ["todo_id", 2], ["LIMIT", 1], ["OFFSET", 0]]

  def create
    @task = Task.new(task_params)
    @task.user = current_user
    @task.todo = @todo
    if @task.save
---
INSERT INTO "tasks" ("content", "todo_id", "user_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "New Task"], ["todo_id", 2], ["user_id", 2], ["status", "todo"], ["created_at", "2021-06-18 10:05:50.692071"], ["updated_at", "2021-06-18 10:05:50.692071"]]

  def destroy
    if @task.user != current_user
      render json: { success: false, errors: ['You don\'t have this task'] }, status: :not_found
      return
    end
    if @task.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]

  def set_todo
    @todo = Todo.find(params[:todo_id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_todo_task
    @task = @todo.tasks.find_by!(id: params[:id]) if @todo
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."todo_id" = ? AND "tasks"."id" = ? LIMIT ?  [["todo_id", 1], ["id", 1], ["LIMIT", 1]]