server/app/controllers/todos_controller.rb

SELECT COUNT(*) FROM "todos" WHERE "todos"."user_id" = ?  [["user_id", 2]]
SELECT "todos".* FROM "todos"
---
  def index
    @todos = current_user.todos.page(current_page).per(per_page)

INSERT INTO "todos" ("title", "short_description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Testing"], ["short_description", "Testing too"], ["user_id", 1], ["created_at", "2021-06-23 15:00:30.715675"], ["updated_at", "2021-06-23 15:00:30.715675"]]
---
  def create
    @todo = Todo.new(todo_params)
    @todo.user = current_user
    if @todo.save

UPDATE "todos" SET "title" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Mock Project 2"], ["updated_at", "2021-06-24 03:42:28.392578"], ["id", 1]]
---
  def update
    if @todo.user != current_user
      not_found_todo
      return
    end
    if @todo.update(todo_params)

DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]
---
  def destroy
    if @todo.user != current_user
      not_found_todo
      return
    end
    if @todo.destroy

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_todo
    @todo = Todo.find(params[:id])